Revit 2027 API
SpecTypeId.StationingInterval Property
 Stationing Interval, in discipline Infrastructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StationingInterval { get; }
Public Shared ReadOnly Property StationingInterval As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StationingInterval {
	ForgeTypeId^ get ();
}
static member StationingInterval : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace